config/soap-login-community-user-example.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header>
    <n1:LoginScopeHeader xmlns:n1="urn:partner.soap.sforce.com">
      <n1:organizationId>00Df2000000BUEo</n1:organizationId>
    </n1:LoginScopeHeader>
  </env:Header>
  <env:Body>
    <n1:login xmlns:n1="urn:partner.soap.sforce.com">
      <n1:username>Yourusername@example.com</n1:username>
      <n1:password>Yourpassword</n1:password>
    </n1:login>
  </env:Body>
</env:Envelope>